print('Программа поможет старшему поколению понимать современные словечки')
while True:
    meme_dict = {
                "КРИНЖ": "Что-то очень странное или стыдное",
                "ЛОЛ": "Что-то очень смешное",
                'РОФЛ': 'шутка',
                'ЩИЩ': 'одобрение или восторг',
                'КРИПОВЫЙ': 'страшный, пугающий',
                'АГРИТЬСЯ': 'злиться',
                'ЭМОДЗИ': 'смайлики в месенджерах',
                'ТРЕШ': 'Что-то плохое'
                }
    word = input("Введите непонятное слово (большими буквами!): ")
    if word in meme_dict.keys():
        print(meme_dict[word])
    else:
        print('Слова нет в словаре')
